Catalogs/ИдентификаторыСтрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрок</Name>
			<Comment>Содержит связку текстовая строка - идентификатор этой строки как ГУИД элемента справочника</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПолнуюСтроку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицированнаяСтрока</Name>
					<Comment>Используется для поиска, не содержит пробелов, все символы в нижнем регистре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписываемыйОбъект</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнаяСтрока</Name>
					<Comment>В отиличие от наименования длина данной строки не ограничена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Comment>Признак группировки ответов на конкретный вопрос в отчетах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИдентификаторыСтрок/Ext/ManagerModule.bsl
Функция УстановиИдентификаторСтроки(ИсходнаяСтрока, ОписываемыйОбъект="", ПолнаяСтрока = "", Характеристика= "") Экспорт     
	
	Если ТипЗнч(ИсходнаяСтрока) <> Тип("Строка") Тогда
		Возврат Справочники.ИдентификаторыСтрок.ПустаяСсылка();
	КонецЕсли;
	
	МодифицированнаяСтрока = Конвертация.МодифицироватьСтроку(ИсходнаяСтрока);
	
	Если СтрДлина(МодифицированнаяСтрока) = 0 Тогда
		Возврат Справочники.ИдентификаторыСтрок.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка, Характеристика ИЗ Справочник.ИдентификаторыСтрок ГДЕ МодифицированнаяСтрока ПОДОБНО &Наименование");
	Запрос.УстановитьПараметр("Наименование", МодифицированнаяСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		//Запиши новую характеристику
		//-----------------------------
		Если ЗначениеЗаполнено(Характеристика) И Выборка.Характеристика <> Характеристика Тогда	
			Запись =  Выборка.Ссылка.ПолучитьОбъект();
			Запись.Характеристика			=	Характеристика;
			Запись.Записать();
		КонецЕсли;		
		Возврат Выборка.Ссылка;		
	Иначе
		НоваяЗапись = Справочники.ИдентификаторыСтрок.СоздатьЭлемент();
		НоваяЗапись.Наименование			=	ИсходнаяСтрока;
		НоваяЗапись.МодифицированнаяСтрока	=	МодифицированнаяСтрока;
		НоваяЗапись.ОписываемыйОбъект		=	ОписываемыйОбъект;
		НоваяЗапись.Характеристика			=	Характеристика;
		
		//Используй полную строку, если длина исходной строки более 150 строк
		Доступно = СтрДлина(ИсходнаяСтрока)>150 И ПолнаяСтрока <> "";        
		НоваяЗапись.ИспользоватьПолнуюСтроку = ?(Доступно, Истина, НоваяЗапись.ИспользоватьПолнуюСтроку); 
		НоваяЗапись.ПолнаяСтрока = ?(ПолнаяСтрока = "", ИсходнаяСтрока, ПолнаяСтрока);                    
		
		НоваяЗапись.Записать();
		Возврат НоваяЗапись.Ссылка;
	КонецЕсли;
	
КонецФункции
